Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.LoadsMayBeNotUpToDate Property
 Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LoadsMayBeNotUpToDate { get; }
Visual Basic
Public Shared ReadOnly Property LoadsMayBeNotUpToDate As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LoadsMayBeNotUpToDate {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace